zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_inputmux_connections.h
    /* FLEXCOMM12 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm12         = 0U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm12         = 1U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm12         = 2U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm12         = 3U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm12       = 4U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm12       = 5U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm12       = 6U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm12        = 7U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm12        = 8U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm12        = 9U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm12        = 10U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm12        = 11U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm12 = 12U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm12        = 13U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm12        = 14U + (FLEXCOMM12_ITRIG_PMUX_ID << PMUX_SHIFT),

    /* FLEXCOMM13 TRIG input mux */
    kINPUTMUX_CtInp0ToFlexcomm13         = 0U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToFlexcomm13         = 1U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToFlexcomm13         = 2U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToFlexcomm13         = 3U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out3ToFlexcomm13       = 4U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out6ToFlexcomm13       = 5U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0Out9ToFlexcomm13       = 6U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct0Mat3ToFlexcomm13        = 7U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct1Mat3ToFlexcomm13        = 8U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct2Mat3ToFlexcomm13        = 9U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToFlexcomm13        = 10U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToFlexcomm13        = 11U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BMatchToFlexcomm13 = 12U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToFlexcomm13        = 13U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToFlexcomm13        = 14U + (FLEXCOMM13_ITRIG_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier0 capture input mux. */
    kINPUTMUX_CtInp0ToTimer0CaptureChannels     = 0U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer0CaptureChannels     = 1U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer0CaptureChannels     = 2U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer0CaptureChannels     = 3U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer0CaptureChannels     = 4U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer0CaptureChannels     = 5U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer0CaptureChannels     = 6U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer0CaptureChannels     = 7U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer0CaptureChannels     = 8U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer0CaptureChannels     = 9U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp10ToTimer0CaptureChannels    = 10U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp11ToTimer0CaptureChannels    = 11U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp12ToTimer0CaptureChannels    = 12U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp13ToTimer0CaptureChannels    = 13U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp14ToTimer0CaptureChannels    = 14U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp15ToTimer0CaptureChannels    = 15U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0TxSyncToTimer0CaptureChannels = 16U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0RxSyncToTimer0CaptureChannels = 17U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1TxSyncToTimer0CaptureChannels = 18U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1RxSyncToTimer0CaptureChannels = 19U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2TxSyncToTimer0CaptureChannels = 20U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2RxSyncToTimer0CaptureChannels = 21U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0SofToTimer0CaptureChannels    = 22U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1SofToTimer0CaptureChannels    = 23U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer0CaptureChannels    = 24U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer0CaptureChannels = 25U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer0CaptureChannels = 26U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut0ToTimer0CaptureChannels   = 27U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut1ToTimer0CaptureChannels   = 28U + (CT32BIT0_CAP_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier1 capture input mux. */
    kINPUTMUX_CtInp0ToTimer1CaptureChannels     = 0U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer1CaptureChannels     = 1U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer1CaptureChannels     = 2U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer1CaptureChannels     = 3U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer1CaptureChannels     = 4U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer1CaptureChannels     = 5U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer1CaptureChannels     = 6U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer1CaptureChannels     = 7U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer1CaptureChannels     = 8U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer1CaptureChannels     = 9U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp10ToTimer1CaptureChannels    = 10U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp11ToTimer1CaptureChannels    = 11U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp12ToTimer1CaptureChannels    = 12U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp13ToTimer1CaptureChannels    = 13U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp14ToTimer1CaptureChannels    = 14U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp15ToTimer1CaptureChannels    = 15U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0TxSyncToTimer1CaptureChannels = 16U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0RxSyncToTimer1CaptureChannels = 17U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1TxSyncToTimer1CaptureChannels = 18U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1RxSyncToTimer1CaptureChannels = 19U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2TxSyncToTimer1CaptureChannels = 20U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2RxSyncToTimer1CaptureChannels = 21U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0SofToTimer1CaptureChannels    = 22U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1SofToTimer1CaptureChannels    = 23U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer1CaptureChannels    = 24U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer1CaptureChannels = 25U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer1CaptureChannels = 26U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut0ToTimer1CaptureChannels   = 27U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut1ToTimer1CaptureChannels   = 28U + (CT32BIT1_CAP_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier2 capture input mux. */
    kINPUTMUX_CtInp0ToTimer2CaptureChannels     = 0U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer2CaptureChannels     = 1U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer2CaptureChannels     = 2U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer2CaptureChannels     = 3U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer2CaptureChannels     = 4U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer2CaptureChannels     = 5U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer2CaptureChannels     = 6U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer2CaptureChannels     = 7U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer2CaptureChannels     = 8U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer2CaptureChannels     = 9U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp10ToTimer2CaptureChannels    = 10U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp11ToTimer2CaptureChannels    = 11U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp12ToTimer2CaptureChannels    = 12U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp13ToTimer2CaptureChannels    = 13U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp14ToTimer2CaptureChannels    = 14U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp15ToTimer2CaptureChannels    = 15U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0TxSyncToTimer2CaptureChannels = 16U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0RxSyncToTimer2CaptureChannels = 17U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1TxSyncToTimer2CaptureChannels = 18U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1RxSyncToTimer2CaptureChannels = 19U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2TxSyncToTimer2CaptureChannels = 20U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2RxSyncToTimer2CaptureChannels = 21U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0SofToTimer2CaptureChannels    = 22U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1SofToTimer2CaptureChannels    = 23U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer2CaptureChannels    = 24U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer2CaptureChannels = 25U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer2CaptureChannels = 26U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut0ToTimer2CaptureChannels   = 27U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut1ToTimer2CaptureChannels   = 28U + (CT32BIT2_CAP_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier3 capture input mux. */
    kINPUTMUX_CtInp0ToTimer3CaptureChannels     = 0U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer3CaptureChannels     = 1U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer3CaptureChannels     = 2U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer3CaptureChannels     = 3U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer3CaptureChannels     = 4U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer3CaptureChannels     = 5U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer3CaptureChannels     = 6U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer3CaptureChannels     = 7U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer3CaptureChannels     = 8U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer3CaptureChannels     = 9U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp10ToTimer3CaptureChannels    = 10U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp11ToTimer3CaptureChannels    = 11U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp12ToTimer3CaptureChannels    = 12U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp13ToTimer3CaptureChannels    = 13U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp14ToTimer3CaptureChannels    = 14U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp15ToTimer3CaptureChannels    = 15U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0TxSyncToTimer3CaptureChannels = 16U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0RxSyncToTimer3CaptureChannels = 17U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1TxSyncToTimer3CaptureChannels = 18U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1RxSyncToTimer3CaptureChannels = 19U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2TxSyncToTimer3CaptureChannels = 20U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2RxSyncToTimer3CaptureChannels = 21U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0SofToTimer3CaptureChannels    = 22U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1SofToTimer3CaptureChannels    = 23U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer3CaptureChannels    = 24U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer3CaptureChannels = 25U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer3CaptureChannels = 26U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut0ToTimer3CaptureChannels   = 27U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut1ToTimer3CaptureChannels   = 28U + (CT32BIT3_CAP_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier4 capture input mux. */
    kINPUTMUX_CtInp0ToTimer4CaptureChannels     = 0U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer4CaptureChannels     = 1U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer4CaptureChannels     = 2U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer4CaptureChannels     = 3U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer4CaptureChannels     = 4U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer4CaptureChannels     = 5U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer4CaptureChannels     = 6U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer4CaptureChannels     = 7U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer4CaptureChannels     = 8U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer4CaptureChannels     = 9U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp10ToTimer4CaptureChannels    = 10U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp11ToTimer4CaptureChannels    = 11U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp12ToTimer4CaptureChannels    = 12U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp13ToTimer4CaptureChannels    = 13U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp14ToTimer4CaptureChannels    = 14U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp15ToTimer4CaptureChannels    = 15U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0TxSyncToTimer4CaptureChannels = 16U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0RxSyncToTimer4CaptureChannels = 17U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1TxSyncToTimer4CaptureChannels = 18U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1RxSyncToTimer4CaptureChannels = 19U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2TxSyncToTimer4CaptureChannels = 20U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2RxSyncToTimer4CaptureChannels = 21U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0SofToTimer4CaptureChannels    = 22U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1SofToTimer4CaptureChannels    = 23U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer4CaptureChannels    = 24U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer4CaptureChannels = 25U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer4CaptureChannels = 26U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut0ToTimer4CaptureChannels   = 27U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut1ToTimer4CaptureChannels   = 28U + (CT32BIT4_CAP_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier0 Input trigger mux. */
    kINPUTMUX_CtInp0ToTimer0Trigger     = 0U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer0Trigger     = 1U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer0Trigger     = 2U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer0Trigger     = 3U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer0Trigger     = 4U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer0Trigger     = 5U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer0Trigger     = 6U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer0Trigger     = 7U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer0Trigger     = 8U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer0Trigger     = 9U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp10ToTimer0Trigger    = 10U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp11ToTimer0Trigger    = 11U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp12ToTimer0Trigger    = 12U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp13ToTimer0Trigger    = 13U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp14ToTimer0Trigger    = 14U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp15ToTimer0Trigger    = 15U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0TxSyncToTimer0Trigger = 16U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0RxSyncToTimer0Trigger = 17U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1TxSyncToTimer0Trigger = 18U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1RxSyncToTimer0Trigger = 19U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2TxSyncToTimer0Trigger = 20U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2RxSyncToTimer0Trigger = 21U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0SofToTimer0Trigger    = 22U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1SofToTimer0Trigger    = 23U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer0Trigger    = 24U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer0Trigger = 25U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer0Trigger = 26U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut0ToTimer0Trigger   = 27U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut1ToTimer0Trigger   = 28U + (CT32BIT0_TRIG_PMUX_ID << PMUX_SHIFT),

    /*!< CTmier1 Input trigger mux. */
    kINPUTMUX_CtInp0ToTimer1Trigger     = 0U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp1ToTimer1Trigger     = 1U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp2ToTimer1Trigger     = 2U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp3ToTimer1Trigger     = 3U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp4ToTimer1Trigger     = 4U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp5ToTimer1Trigger     = 5U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp6ToTimer1Trigger     = 6U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp7ToTimer1Trigger     = 7U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp8ToTimer1Trigger     = 8U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp9ToTimer1Trigger     = 9U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp10ToTimer1Trigger    = 10U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp11ToTimer1Trigger    = 11U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp12ToTimer1Trigger    = 12U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp13ToTimer1Trigger    = 13U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp14ToTimer1Trigger    = 14U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_CtInp15ToTimer1Trigger    = 15U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0TxSyncToTimer1Trigger = 16U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai0RxSyncToTimer1Trigger = 17U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1TxSyncToTimer1Trigger = 18U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai1RxSyncToTimer1Trigger = 19U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2TxSyncToTimer1Trigger = 20U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sai2RxSyncToTimer1Trigger = 21U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0SofToTimer1Trigger    = 22U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1SofToTimer1Trigger    = 23U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cmp0OutToTimer1Trigger    = 24U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp0ToTimer1Trigger = 25U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0Tcomp1ToTimer1Trigger = 26U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut0ToTimer1Trigger   = 27U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut1ToTimer1Trigger   = 28U + (CT32BIT1_TRIG_PMUX_ID << PMUX_SHIFT),

