zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_inputmux_connections.h
    /*!< Frequency measurement target clock. */
    kINPUTMUX_OscClkToFreqmeasTar         = 0U + (FREQME_TAR_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Fro1Div8ToFreqmeasTar       = 1U + (FREQME_TAR_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Fro1ToFreqmeasTar           = 2U + (FREQME_TAR_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_LposcToFreqmeasTar          = 3U + (FREQME_TAR_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_32KhzOscToFreqmeasTar       = 4U + (FREQME_TAR_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Fro0ToFreqmeasTar           = 6U + (FREQME_TAR_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Fro2ToFreqmeasTar           = 7U + (FREQME_TAR_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_FreqmeGpioAClkToFreqmeasTar = 8U + (FREQME_TAR_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_FreqmeGpioBClkToFreqmeasTar = 9U + (FREQME_TAR_PMUX_ID << PMUX_SHIFT),

    /*!< EZHV input mux. */
    kINPUTMUX_GpioInt0Trig0ToEzhv    = 0U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0Trig1ToEzhv    = 1U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt1Trig0ToEzhv    = 2U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt1Trig1ToEzhv    = 3U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt2Trig0ToEzhv    = 4U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt2Trig1ToEzhv    = 5U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt3Trig0ToEzhv    = 6U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt3Trig1ToEzhv    = 7U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt4Trig0ToEzhv    = 8U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt4Trig1ToEzhv    = 9U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt5Trig0ToEzhv    = 10U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt5Trig1ToEzhv    = 11U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt6Trig0ToEzhv    = 12U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt6Trig1ToEzhv    = 13U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt7Trig0ToEzhv    = 14U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt7Trig1ToEzhv    = 15U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm0IrqToEzhv     = 16U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm1IrqToEzhv     = 17U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm2IrqToEzhv     = 18U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm3IrqToEzhv     = 19U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm4IrqToEzhv     = 20U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm5IrqToEzhv     = 21U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm6IrqToEzhv     = 22U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm7IrqToEzhv     = 23U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm14IrqToEzhv    = 24U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Flexcomm16IrqToEzhv    = 25U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_I3c0IrqToEzhv          = 26U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_I3c1IrqToEzhv          = 27U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_I3c2IrqToEzhv          = 28U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_I3c3IrqToEzhv          = 29U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_FlexioIrqToEzhv        = 30U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio0IrqToEzhv         = 31U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio1IrqToEzhv         = 32U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio2IrqToEzhv         = 33U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio3IrqToEzhv         = 34U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio4IrqToEzhv         = 35U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio5IrqToEzhv         = 36U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio6IrqToEzhv         = 37U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio7IrqToEzhv         = 38U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio8IrqToEzhv         = 39U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio9IrqToEzhv         = 40U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Gpio10IrqToEzhv        = 41U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sct0IrqToEzhv          = 42U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer0IrqToEzhv       = 43U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer1IrqToEzhv       = 44U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer2IrqToEzhv       = 45U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer3IrqToEzhv       = 46U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer4IrqToEzhv       = 47U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer5IrqToEzhv       = 48U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer6IrqToEzhv       = 49U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ctimer7IrqToEzhv       = 50U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Utick0IrqToEzhv        = 51U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Mrt0IrqToEzhv          = 52U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Rtc0IrqToEzhv          = 53U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_OsEventIrqToEzhv       = 54U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Wdt0IrqToEzhv          = 55U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Wdt1IrqToEzhv          = 56U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Adc0IrqToEzhv          = 57U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_AcmpIrqToEzhv          = 58U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_MicfilIrqToEzhv        = 59U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_HwvadToEzhv            = 60U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sdio0IrqToEzhv         = 61U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Sdio1IrqToEzhv         = 62U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0IrqToEzhv          = 63U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1IrqToEzhv          = 64U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_LcdifIrqToEzhv         = 65U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpuIrqToEzhv           = 66U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Ch0IrqToEzhv       = 67U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Ch1IrqToEzhv       = 68U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Ch2IrqToEzhv       = 69U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma0Ch3IrqToEzhv       = 70U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Ch0IrqToEzhv       = 71U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Ch1IrqToEzhv       = 72U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Ch2IrqToEzhv       = 73U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma1Ch3IrqToEzhv       = 74U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma2Ch0IrqToEzhv       = 75U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma2Ch1IrqToEzhv       = 76U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma2Ch2IrqToEzhv       = 77U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma2Ch3IrqToEzhv       = 78U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma3Ch0IrqToEzhv       = 79U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma3Ch1IrqToEzhv       = 80U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma3Ch2IrqToEzhv       = 81U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dma3Ch3IrqToEzhv       = 82U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dsp0TieExpstate1ToEzhv = 83U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Dsp1TieExpstate1ToEzhv = 84U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_SctOut8ToEzhv          = 85U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_SctOut9ToEzhv          = 86U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat3ToEzhv          = 87U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct4Mat2ToEzhv          = 88U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat3ToEzhv          = 89U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Ct3Mat2ToEzhv          = 90U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Cpu0TxevToEzhv         = 91U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_GpioInt0BmatchToEzhv   = 92U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_MipiIrqToEzhv          = 93U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb0SofToEzhv          = 94U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_Usb1SofToEzhv          = 95U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut0ToEzhv         = 96U + (EZHV_PMUX_ID << PMUX_SHIFT),
    kINPUTMUX_TmprOut1ToEzhv         = 97U + (EZHV_PMUX_ID << PMUX_SHIFT),

